{
  "sessions":[
    {
      "title": "Revving Up with Java: A Beginner's Journey into Automotive Hacking",
      "startsAt": "2025-11-06T07:00:00.0000000Z",
      "endsAt": "2025-11-06T07:50:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 8",
      "speakers": [
        "Roald Nefs"
      ],
      "description": "Modern vehicles are complex networks of hardware and software that are increasingly vulnerable to cyber‑attacks. This beginner‑friendly talk introduces automotive hacking and security for Java developers, showing how to interact with the CAN bus, identify vulnerabilities and build more secure connected vehicles."
    },
    {
      "title": "Catching the 137-Killer: A Java Memory Forensics Investigation",
      "startsAt": "2025-11-06T07:00:00.0000000Z",
      "endsAt": "2025-11-06T07:50:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 6",
      "speakers": [
        "Martijn Dashorst"
      ],
      "description": "A true‑crime‑style investigation into Java memory forensics. Learn about JVM memory areas, container OOMKills, heap dumps, native memory tracking and memory tuning strategies to keep your applications alive and prevent mysterious process deaths."
    },
    {
      "title": "Documentation Is a Team Sport – Start Treating It That Way",
      "startsAt": "2025-11-06T07:00:00.0000000Z",
      "endsAt": "2025-11-06T07:50:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 5",
      "speakers": [
        "Ted Vinke"
      ],
      "description": "Documentation is not an afterthought; it multiplies knowledge and speed across teams. This talk explores what different roles need from docs, introduces tools like ADRs, OpenAPI and the Diátaxis framework, and shows how AI is reshaping how we write and consume documentation."
    },
    {
      "title": "Be more productive with IntelliJ IDEA",
      "startsAt": "2025-11-06T07:00:00.0000000Z",
      "endsAt": "2025-11-06T07:50:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 4",
      "speakers": [
        "Marit van Dijk"
      ],
      "description": "Discover how IntelliJ IDEA helps developers stay in flow with a powerful editor, refactorings, navigation and integrated tools like Maven, Gradle, Spring, Git and databases. See how the IDE supports your workflow without leaving it and learn tips to become a happier, more productive developer."
    },
    {
      "title": "When ORM Becomes OMG: Performance Pitfalls in JPA and Friends",
      "startsAt": "2025-11-06T07:00:00.0000000Z",
      "endsAt": "2025-11-06T07:50:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 3",
      "speakers": [
        "Jos Roseboom"
      ],
      "description": "Object–relational mapping can be magical until your app grinds to a halt. Using a sample app, this session explores common performance pitfalls in JPA and related libraries—from data loading surprises to connection mismanagement—and shows how tooling can help you spot trouble before users do."
    },
    {
      "title": "From Utopia to Reality: The Hidden Challenges of Event-Driven Architecture",
      "startsAt": "2025-11-06T07:00:00.0000000Z",
      "endsAt": "2025-11-06T07:50:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 2",
      "speakers": [
        "Ruben Scheedler"
      ],
      "description": "Event‑driven microservices promise asynchronous, decoupled scalability but they’re hard to tame. This talk shares real‑world challenges encountered when adopting event‑driven architecture—out‑of‑order messages, scheduling, versioning and legacy integration—and offers lessons on taming the dragon."
    },
    {
      "title": "Certificates and encryption; All you need to know, but...",
      "startsAt": "2025-11-06T07:00:00.0000000Z",
      "endsAt": "2025-11-06T07:50:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 1",
      "speakers": [
        "Pieter van der Meer"
      ],
      "description": "An introduction to certificates and encryption for developers. Learn why TLS/SSL, mTLS, http/https and algorithms like RSA and DES matter, what Zero Trust really means and why understanding the lock in the browser is essential for secure systems."
    },
    {
      "title": "Opening",
      "startsAt": "2025-11-06T08:00:00.0000000Z",
      "endsAt": "2025-11-06T08:20:00.0000000Z",
      "category": [],
      "room": "Room 9",
      "speakers": [],
      "description": "Official opening of the conference and welcome remarks."
    },
    {
      "title": "Java; our personal career companion",
      "startsAt": "2025-11-06T08:20:00.0000000Z",
      "endsAt": "2025-11-06T08:45:00.0000000Z",
      "category": [
        "Keynote",
        "Beginner"
      ],
      "room": "Room 9",
      "speakers": [
        "Peter Schuler",
        "Ragna Gerretsen"
      ],
      "description": "Two speakers share their parallel journeys learning Java and navigating their careers. Hear about their struggles, growth and the lessons they learned as both Java and their careers evolved."
    },
    {
      "title": "Why You Should Build Agents on the JVM",
      "startsAt": "2025-11-06T08:45:00.0000000Z",
      "endsAt": "2025-11-06T09:10:00.0000000Z",
      "category": [
        "Keynote",
        "Intermediate"
      ],
      "room": "Room 9",
      "speakers": [
        "Rod Johnson"
      ],
      "description": "Keynote explaining why Java developers have a critical role to play in the evolution of generative AI and why building agents on the JVM matters."
    },
    {
      "title": "Coffee break",
      "startsAt": "2025-11-06T09:10:00.0000000Z",
      "endsAt": "2025-11-06T09:35:00.0000000Z",
      "category": [],
      "room": "Market floor",
      "speakers": [],
      "description": "Time to grab a coffee and network with fellow attendees."
    },
    {
      "title": "Java 25 - Better Language, Better APIs, Better Runtime",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T10:25:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 9",
      "speakers": [
        "Nicolai Parlog"
      ],
      "description": "Preview of Java 25’s features: unnamed patterns, module imports, the foreign‑function and memory API, stream gatherers, class‑file API, simpler main methods, multi‑source launches, Markdown in JavaDoc, quantum‑resistant encryption and improved startup and garbage collection."
    },
    {
      "title": "Next level persistence in Jakarta EE: Jakarta Data and Jakarta NoSQL",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T10:25:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 8",
      "speakers": [
        "Arjan Tijms"
      ],
      "description": "Jakarta EE 11 introduces Jakarta Data, a repository‑style API that standardizes data access across relational and NoSQL stores. This talk demystifies how it relates to JPA and Jakarta NoSQL, introduces JDQL and shows examples with Eclipse JNoSQL. Learn when to use each approach and what’s next."
    },
    {
      "title": "Concurrency Crossroads: Choosing between Reactive Programming and Virtual Threads in Quarkus",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T10:25:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 7",
      "speakers": [
        "Willem Jan Glerum"
      ],
      "description": "Reactive programming has long been used for high‑performance, non‑blocking code, but Project Loom’s virtual threads present another option. This session compares the two paradigms, explores their pros and cons with real examples in Quarkus and helps you choose the right approach for your next project."
    },
    {
      "title": "Level Up Your LangChain4j Apps for Production",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T10:25:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 6",
      "speakers": [
        "Lize Raes"
      ],
      "description": "Join the maintainers of LangChain4j for a tour of its latest features. See a demo of an AI researcher agent for drug discovery and learn about guardrails, observability, multi‑LLM orchestration, agents, testing and advanced RAG to take your AI apps from proof‑of‑concept to production."
    },
    {
      "title": "From Exceptions to Rich Errors: Rethinking Error Handling in Kotlin",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T10:25:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 5",
      "speakers": [
        "Michail Zarečenskij"
      ],
      "description": "Explore how Java’s exception model works, how Kotlin evolved it and other approaches like Result, Optional and sealed hierarchies. Learn about Kotlin’s new Rich Errors model—treating errors as values integrated into the type system—and how to use it for more predictable error handling."
    },
    {
      "title": "Making Sense of Vector Databases",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T10:25:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 4",
      "speakers": [
        "Balkrishna Rawool"
      ],
      "description": "Vector databases are popular in AI because they enable semantic search. This session introduces the fundamentals—vectors, vectorization techniques, indexing algorithms and similarity metrics—and uses progressively complex examples to illustrate how vector databases store and search data."
    },
    {
      "title": "Migrating Petabytes of Heritage Data to S3: Lessons Learned from the Dutch Royal Library",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T10:25:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 3",
      "speakers": [
        "Tonny Garić",
        "Patrick Beks"
      ],
      "description": "A deep dive into migrating over 2 PB of unique heritage data from tape archives to S3‑compatible storage. Learn best practices for preserving metadata, structuring buckets, ensuring resilience and using Spring Batch and the AWS SDK for Java to orchestrate large‑scale ETL operations."
    },
    {
      "title": "Work experiments - A test-driven approach to modern teamwork",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T10:25:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 2",
      "speakers": [
        "Sven Peters"
      ],
      "description": "Teamwork is evolving. Instead of big transformations, Atlassian uses small work experiments to improve meetings, decision‑making and feedback loops. Learn how to design and run these experiments, evaluate results and build a culture that embraces change and innovation."
    },
    {
      "title": "Accelerating Maven Builds: From Snail's Paceto Rocket Speed",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T10:25:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 1",
      "speakers": [
        "Maarten Mulders"
      ],
      "description": "Tired of slow Maven builds? Learn three mechanisms to supercharge your builds, when they offer the biggest gains and common pitfalls. Apply these tips to decrease context switching, increase developer speed and turn snail‑paced builds into rocket launches."
    },
    {
      "title": "Offensive AI",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T11:30:00.0000000Z",
      "category": [
        "Hands-on Lab",
        "Beginner"
      ],
      "room": "Hands-on labs",
      "speakers": [
        "Arjen Wiersma"
      ],
      "description": "Hands‑on workshop teaching you to think like an attacker. Learn prompt injection, attack AI app connections, hunt for AI‑specific security holes, use AI to find vulnerabilities and build stronger defences. Ideal for developers and security experts who want to secure AI systems."
    },
    {
      "title": "The Mentorship Hub",
      "startsAt": "2025-11-06T09:35:00.0000000Z",
      "endsAt": "2025-11-06T16:45:00.0000000Z",
      "category": [
        "Unconference",
        "Intermediate"
      ],
      "room": "Market floor",
      "speakers": [
        "Bruno Souza"
      ],
      "description": "Meet Java Champions and community luminaries in small group mentoring sessions. Get personalized advice on advancing your career—whether you want to contribute to open source, write a book or become an independent consultant."
    },
    {
      "title": "Supercharge your LLM with Java: Model Context Protocol (MCP) in Action",
      "startsAt": "2025-11-06T10:40:00.0000000Z",
      "endsAt": "2025-11-06T11:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 9",
      "speakers": [
        "Urs Peter"
      ],
      "description": ""
    },
    {
      "title": "Less is more: reduce $ and CO₂ to improve performanceand joy",
      "startsAt": "2025-11-06T10:40:00.0000000Z",
      "endsAt": "2025-11-06T10:55:00.0000000Z",
      "category": [
        "Byte size (16 min)",
        "Intermediate"
      ],
      "room": "Room 8",
      "speakers": [
        "Jan Ouwens"
      ],
      "description": "The IT sector is a major CO₂ emitter, but reducing emissions can also save money. This talk explains why emissions matter, how software contributes and shares techniques to shrink Docker containers, speed up frameworks, cut uptime and have fun saving money and the planet."
    },
    {
      "title": "Enterprise Gen AI with Embabel",
      "startsAt": "2025-11-06T10:40:00.0000000Z",
      "endsAt": "2025-11-06T11:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 7",
      "speakers": [
        "Rod Johnson"
      ],
      "description": "Hands‑on session where Rod Johnson demonstrates how to build generative AI agents in Java using Embabel."
    },
    {
      "title": "Supercharge your JVM performance with Project Leyden",
      "startsAt": "2025-11-06T10:40:00.0000000Z",
      "endsAt": "2025-11-06T11:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 6",
      "speakers": [
        "Ana Maria Mihalceanu"
      ],
      "description": "Project Leyden aims to improve Java’s startup time and time‑to‑peak performance. Learn how to leverage Leyden’s optimizations in Java 25 to make microservices and Kubernetes workloads more responsive, and get a peek at ongoing work inside Leyden."
    },
    {
      "title": "Java Beyond Frameworks: Avoiding Lock-In with Agnostic Design",
      "startsAt": "2025-11-06T10:40:00.0000000Z",
      "endsAt": "2025-11-06T11:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 5",
      "speakers": [
        "Rijo Sam"
      ],
      "description": "Modern frameworks like Spring Boot speed development but create lock‑in and bloat. This talk advocates a layered, framework‑agnostic approach: decouple business logic with JSR standards, replace framework annotations and integrate cloud services without coupling. Learn patterns, trade‑offs and when to adopt this approach."
    },
    {
      "title": "Technical Enshittification: Why Everything in IT is Horrible Right Now and How to Fix It",
      "startsAt": "2025-11-06T10:40:00.0000000Z",
      "endsAt": "2025-11-06T11:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 4",
      "speakers": [
        "Baruch Sadogursky"
      ],
      "description": "Software feels bloated, sluggish and complex because building it has become an obstacle course of tools, approvals and abstractions. This talk cuts through the mess and shows how AI, smarter tooling and better developer workflows can help us build good software again."
    },
    {
      "title": "A door with no locks? Let’s talk about threat modeling",
      "startsAt": "2025-11-06T10:40:00.0000000Z",
      "endsAt": "2025-11-06T11:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 3",
      "speakers": [
        "Bárbara Teruggi"
      ],
      "description": "Threat modeling isn’t new but it’s now essential in product design. Developers should be involved from the start. Learn key risk concepts, the threat‑modeling process and how collaborative threat modeling leads to more secure applications."
    },
    {
      "title": "Your Brain Is Sabotaging Your Code, But We Can Outsmart It",
      "startsAt": "2025-11-06T10:40:00.0000000Z",
      "endsAt": "2025-11-06T11:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Advanced"
      ],
      "room": "Room 2",
      "speakers": [
        "Ines Panker"
      ],
      "description": "Cognitive biases like anchoring cause developers to prefer the first solution they hear, leading to bugs and rewrites. This talk exposes how biases creep into software development, cause mistakes and how to fight them."
    },
    {
      "title": "The tech behind Buienradar: How technology keeps you ahead of the weather",
      "startsAt": "2025-11-06T10:40:00.0000000Z",
      "endsAt": "2025-11-06T11:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 1",
      "speakers": [
        "Neel Bhatt"
      ],
      "description": "Take a behind‑the‑scenes look at Buienradar, the Netherlands’ biggest weather platform. Learn how its scalable infrastructure and algorithms process vast data, how the team migrated to Kubernetes, and how they maximize observability with Grafana to serve millions of users."
    },
    {
      "title": "A Java Developer's Quest for I/O Performance",
      "startsAt": "2025-11-06T10:55:00.0000000Z",
      "endsAt": "2025-11-06T11:10:00.0000000Z",
      "category": [
        "Byte size (16 min)",
        "Intermediate"
      ],
      "room": "Room 8",
      "speakers": [
        "David Vlijmincx"
      ],
      "description": "Follow a journey optimizing Java’s io_uring bindings. Through mis‑leading benchmarks, late‑night debugging and profiling, learn practical techniques to measure and systematically improve I/O performance, and discover surprising bottlenecks in the Java ecosystem."
    },
    {
      "title": "Radicle: A better, peer-to-peer, home for Open Source",
      "startsAt": "2025-11-06T11:10:00.0000000Z",
      "endsAt": "2025-11-06T11:25:00.0000000Z",
      "category": [
        "Byte size (16 min)",
        "Beginner"
      ],
      "room": "Room 8",
      "speakers": [
        "Yorgos Saslis"
      ],
      "description": "Open Source needs a resilient, community‑owned alternative. Radicle is a decentralized code forge built on a peer‑to‑peer architecture. Learn how it extends Git with a replication protocol, decentralized identity and novel code discovery, and how to start mirroring your projects."
    },
    {
      "title": "Lunch",
      "startsAt": "2025-11-06T11:30:00.0000000Z",
      "endsAt": "2025-11-06T12:30:00.0000000Z",
      "category": [],
      "room": "Market floor",
      "speakers": [],
      "description": "Lunch break—refuel and network."
    },
    {
      "title": "Ignite Sessions",
      "startsAt": "2025-11-06T11:30:00.0000000Z",
      "endsAt": "2025-11-06T12:30:00.0000000Z",
      "category": [],
      "room": "Room 1",
      "speakers": [],
      "description": "Lightning‑fast talks where speakers present ideas in short, timed sessions."
    },
    {
      "title": "NLJUG Update",
      "startsAt": "2025-11-06T12:30:00.0000000Z",
      "endsAt": "2025-11-06T12:50:00.0000000Z",
      "category": [],
      "room": "Room 9",
      "speakers": [],
      "description": "An update from NLJUG (Netherlands Java User Group) on community news and initiatives."
    },
    {
      "title": "xz: The day the internet (almost) died",
      "startsAt": "2025-11-06T12:50:00.0000000Z",
      "endsAt": "2025-11-06T13:20:00.0000000Z",
      "category": [
        "Keynote",
        "Beginner"
      ],
      "room": "Room 9",
      "speakers": [
        "Reinier Zwitserloot",
        "Roel Spilker"
      ],
      "description": "A story about one of the most elaborate open source supply‑chain attacks: hackers nearly slipped a backdoor into XZ utils. Learn how the attack was discovered, the techniques used to mislead maintainers and why existing safety measures couldn’t have prevented it."
    },
    {
      "title": "Spring Boot: Chapter 4",
      "startsAt": "2025-11-06T13:40:00.0000000Z",
      "endsAt": "2025-11-06T14:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 9",
      "speakers": [
        "Stéphane Nicoll"
      ],
      "description": "Spring Boot 4.0 raises the Java baseline to 17 and introduces new features. Upgrade an existing app to SB4, avoid NullPointerExceptions with Nullness metadata and JSpecify checks, adopt fine‑grained dependencies, integrate Jackson 3.0 and use RestClient in asynchronous scenarios."
    },
    {
      "title": "Sourcing Aliens and Lasers: An Eventful Journey Through Time and Space",
      "startsAt": "2025-11-06T13:40:00.0000000Z",
      "endsAt": "2025-11-06T14:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 8",
      "speakers": [
        "Auke Haanstra"
      ],
      "description": "Using a retro Space Invaders game, this session demonstrates event sourcing: capturing every shot, alien and choice as an immutable stream of events. Learn how event sourcing enables time travel, replay, debugging and insights for building robust, auditable systems."
    },
    {
      "title": "NLJUG Modern IT Leadership Summit 2025",
      "startsAt": "2025-11-06T13:40:00.0000000Z",
      "endsAt": "2025-11-06T14:30:00.0000000Z",
      "category": [],
      "room": "Room 7",
      "speakers": [
        "Bert Jan Schrijver"
      ],
      "description": "A summit session focused on modern IT leadership topics."
    },
    {
      "title": "The definitive guide to Java agents",
      "startsAt": "2025-11-06T13:40:00.0000000Z",
      "endsAt": "2025-11-06T14:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 6",
      "speakers": [
        "Rafael Winterhalter"
      ],
      "description": "Learn how to write Java agents using the instrumentation API. See how to alter running code for monitoring or security, and use Byte Buddy to avoid bytecode complexity. Compare agents with alternatives like AspectJ or Javassist and learn high‑performance techniques."
    },
    {
      "title": "My code is faster than yours... let me prove it to you!",
      "startsAt": "2025-11-06T13:40:00.0000000Z",
      "endsAt": "2025-11-06T14:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 5",
      "speakers": [
        "François Martin"
      ],
      "description": "A code review dispute over a regular expression leads to a challenge: prove the alternative is faster. This talk shows how to do microbenchmarking in Java using JMH, turning code reviews into performance learning opportunities."
    },
    {
      "title": "Writing GPU-Ready AI Models in Pure Java with Babylon",
      "startsAt": "2025-11-06T13:40:00.0000000Z",
      "endsAt": "2025-11-06T14:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 4",
      "speakers": [
        "Lize Raes",
        "Ana Maria Mihalceanu"
      ],
      "description": "Project Babylon’s Code Reflection technology lets you define machine learning logic in plain Java and run it fast on GPUs. Learn how it connects to native runtimes via the FFM API, leverages the Heterogeneous Accelerator Toolkit and bridges Java and modern AI workloads."
    },
    {
      "title": "Innovation award (3 byte size sessions)",
      "startsAt": "2025-11-06T13:40:00.0000000Z",
      "endsAt": "2025-11-06T14:30:00.0000000Z",
      "category": [],
      "room": "Room 3",
      "speakers": [],
      "description": "A session celebrating innovations with three short presentations."
    },
    {
      "title": "curl | bash | hacked: The Unseen Dangers in Your Dev Lifecycle",
      "startsAt": "2025-11-06T13:40:00.0000000Z",
      "endsAt": "2025-11-06T14:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 2",
      "speakers": [
        "Steve Poole"
      ],
      "description": "Supply‑chain attacks often start with ‘curl | bash’. Attackers hide in Git hooks, IDE plugins and build scripts. This talk walks through real attacks and shows defences like isolation, dependency hygiene, short‑lived credentials and monitoring to prevent a single careless installation from becoming a breach."
    },
    {
      "title": "How to build your own fun and absurd pair programmer",
      "startsAt": "2025-11-06T13:40:00.0000000Z",
      "endsAt": "2025-11-06T14:30:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 1",
      "speakers": [
        "Alexander Chatzizacharias"
      ],
      "description": "Tired of boring AI assistants? This session shows how to build a sarcastic, absurd pair programmer using Spring Boot, vector databases and locally running models. Learn RAG flows, multi‑vector search and MCP integrations to create playful agentic workflows."
    },
    {
      "title": "From Scratch to Scalable: Building Smarter AI Agents with Frameworks",
      "startsAt": "2025-11-06T13:40:00.0000000Z",
      "endsAt": "2025-11-06T16:45:00.0000000Z",
      "category": [
        "Hands-on Lab",
        "Intermediate"
      ],
      "room": "Hands-on labs",
      "speakers": [
        "Jettro Coenradie",
        "Daniël Spee"
      ],
      "description": "A workshop guiding you from manually building an AI agent in Java with LLM integration and memory to transforming it into a production‑ready agent using frameworks that add multi‑LLM support, observability and simplified deployment."
    },
    {
      "title": "Coffee Break",
      "startsAt": "2025-11-06T14:30:00.0000000Z",
      "endsAt": "2025-11-06T14:50:00.0000000Z",
      "category": [],
      "room": "Market floor",
      "speakers": [],
      "description": "Break to relax and network."
    },
    {
      "title": "Pushing Java to the Limits: Processing a Billion Rows in Under 2 Seconds",
      "startsAt": "2025-11-06T14:50:00.0000000Z",
      "endsAt": "2025-11-06T15:40:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 9",
      "speakers": [
        "Roy van Rijn"
      ],
      "description": "A deep dive into optimizing Java to process a billion rows of data. Learn about parallelism, memory‑mapped files, SWAR techniques, bit twiddling, branchless code, mechanical sympathy, Graal native compilation and even sun.misc.Unsafe to achieve under‑two‑second processing."
    },
    {
      "title": "The unexpected struggles of maintaining user facing APIs",
      "startsAt": "2025-11-06T14:50:00.0000000Z",
      "endsAt": "2025-11-06T15:05:00.0000000Z",
      "category": [
        "Byte size (16 min)",
        "Intermediate"
      ],
      "room": "Room 8",
      "speakers": [
        "Laura Trotta"
      ],
      "description": "Maintaining open source, user‑facing APIs is rewarding but challenging. This talk shares misconceptions and tricky situations from the presenter’s experience with the official Java client for Elasticsearch and other libraries, balancing changes with user expectations."
    },
    {
      "title": "Benchmarking Project Valhalla",
      "startsAt": "2025-11-06T14:50:00.0000000Z",
      "endsAt": "2025-11-06T15:40:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 7",
      "speakers": [
        "Cay Horstmann"
      ],
      "description": "Project Valhalla introduces value types to Java, reducing pointer indirection and heap allocation. Learn about its current state and how to benchmark its impact, measure memory consumption and examine JIT code to evaluate performance benefits."
    },
    {
      "title": "Growing Beyond Senior: Build Influence and Reputation Through Java, Open Source, and Community",
      "startsAt": "2025-11-06T14:50:00.0000000Z",
      "endsAt": "2025-11-06T15:40:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 6",
      "speakers": [
        "Bruno Souza"
      ],
      "description": "For senior Java developers aiming to become recognized experts, this session presents the Deliberate REPUTATION formula: define your focus, build visibility through open source and community, take meaningful action and avoid common traps."
    },
    {
      "title": "Reduce LLM calls with Vector Search Design Patterns",
      "startsAt": "2025-11-06T14:50:00.0000000Z",
      "endsAt": "2025-11-06T15:40:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 5",
      "speakers": [
        "Raphael De Lio"
      ],
      "description": "LLMs are powerful but expensive. Learn how to handle classification, routing and caching using vector search and semantic patterns. Use embeddings, similarity and semantic caching to reduce unnecessary LLM calls and build smarter, more efficient systems."
    },
    {
      "title": "Teachers Unconference",
      "startsAt": "2025-11-06T14:50:00.0000000Z",
      "endsAt": "2025-11-06T15:40:00.0000000Z",
      "category": [
        "Unconference",
        "Intermediate"
      ],
      "room": "Room 4",
      "speakers": [
        "Hanno Embregts",
        "Pim Tegelaar"
      ],
      "description": "A Birds‑of‑a‑Feather session for those teaching Java or software development. Share experiences on icebreakers, hybrid courses, engaging diverse learners, balancing theory and practice and more. Bring your questions and learn from peers."
    },
    {
      "title": "Building a Developer Chatbot with RAG: From Prototype to Production at Rabobank",
      "startsAt": "2025-11-06T14:50:00.0000000Z",
      "endsAt": "2025-11-06T15:40:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 3",
      "speakers": [
        "Abraham Van der Vyver"
      ],
      "description": "At Rabobank, the Roppie chatbot became a trusted companion for developers. This session explains how the team built a Retrieval‑Augmented Generation (RAG) chatbot, deployed it on Azure, navigated compliance requirements and established continuous evaluation for reliable production use."
    },
    {
      "title": "Platform Teams: Leveraging Spring and Kubernetes for DevEx as a service",
      "startsAt": "2025-11-06T14:50:00.0000000Z",
      "endsAt": "2025-11-06T15:40:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 2",
      "speakers": [
        "Vincent van der Zijden"
      ],
      "description": "As organizations grow, complexity increases. This session explores the value of platform teams to standardize tools, ensure quality and share knowledge. Learn technical solutions using Spring Boot, Kubernetes, Helm and ArgoCD to provide DevEx as a service."
    },
    {
      "title": "The C4 model - beyond the basics",
      "startsAt": "2025-11-06T14:50:00.0000000Z",
      "endsAt": "2025-11-06T15:40:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 1",
      "speakers": [
        "Simon Brown"
      ],
      "description": "Go beyond the basics of the C4 model for visualizing software architecture. Hear advice on modeling shared code, microservices and message‑driven systems, and learn how to scale diagrams for large systems and entire landscapes."
    },
    {
      "title": "What's your favourite number of threads?",
      "startsAt": "2025-11-06T15:05:00.0000000Z",
      "endsAt": "2025-11-06T15:20:00.0000000Z",
      "category": [
        "Byte size (16 min)",
        "Beginner"
      ],
      "room": "Room 8",
      "speakers": [
        "Ryan Healey"
      ],
      "description": "A fun and thought‑provoking talk exploring different answers to the question of the optimal number of threads. Examine technical and human perspectives on thread counts and come away with a surprising final answer."
    },
    {
      "title": "Can LLMs play text adventures?",
      "startsAt": "2025-11-06T15:20:00.0000000Z",
      "endsAt": "2025-11-06T15:35:00.0000000Z",
      "category": [
        "Byte size (16 min)",
        "Beginner"
      ],
      "room": "Room 8",
      "speakers": [
        "Bouke Nijhuis"
      ],
      "description": "Explore how well large language models can play text adventure games. Examine the gaming capabilities of LLMs since ChatGPT’s release and discover whether they can navigate and succeed at classic text adventures."
    },
    {
      "title": "Breaching LLM-Powered Applications: Overcoming Security and Privacy Challenges",
      "startsAt": "2025-11-06T15:55:00.0000000Z",
      "endsAt": "2025-11-06T16:45:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 9",
      "speakers": [
        "Brian Vermeer"
      ],
      "description": "As LLMs power applications, security and privacy risks emerge. Learn about prompt injection, key leakage, misuse of customer data, legal restrictions and general vulnerabilities. Gain strategies to protect data, ensure compliance and develop secure LLM‑powered apps."
    },
    {
      "title": "Stop Chasing Unicorns and Rainbows: The Dangers of Survivorship Bias in Tech",
      "startsAt": "2025-11-06T15:55:00.0000000Z",
      "endsAt": "2025-11-06T16:10:00.0000000Z",
      "category": [
        "Byte size (16 min)",
        "Beginner"
      ],
      "room": "Room 8",
      "speakers": [
        "Louëlla Creemers"
      ],
      "description": "Survivorship bias leads us to focus on unicorn successes and ignore countless failures. This talk examines how luck and external factors influence success, how biased narratives distort reality and offers strategies to maintain a realistic perspective in tech."
    },
    {
      "title": "Optimizing Java on AWS Lambda",
      "startsAt": "2025-11-06T15:55:00.0000000Z",
      "endsAt": "2025-11-06T16:45:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 7",
      "speakers": [
        "Julian Exenberger"
      ],
      "description": "Java has a reputation for slow startup in serverless environments. This session provides tips and tricks to optimize Java performance on AWS Lambda."
    },
    {
      "title": "Fixing time zones for fun - twenty programming puzzles to master internationalization.",
      "startsAt": "2025-11-06T15:55:00.0000000Z",
      "endsAt": "2025-11-06T16:45:00.0000000Z",
      "category": [
        "Technical Session",
        "Intermediate"
      ],
      "room": "Room 6",
      "speakers": [
        "Martijn van Iersel"
      ],
      "description": "Learn internationalization concepts like encodings, time zones, accented characters and daylight savings through twenty programming puzzles inspired by Advent of Code. Solve stories about UTF‑8 validators, right‑to‑left text, Antarctic time zones and more."
    },
    {
      "title": "Essential programming jokes",
      "startsAt": "2025-11-06T15:55:00.0000000Z",
      "endsAt": "2025-11-06T16:45:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 5",
      "speakers": [
        "Peter Hilton",
        "Marit van Dijk"
      ],
      "description": "Programming jokes encode essential knowledge and shared experience. Learn why jokes matter, how to tell them, what they teach and when explaining a joke is actually helpful. Leave with new jokes and insights."
    },
    {
      "title": "Incident Stories",
      "startsAt": "2025-11-06T15:55:00.0000000Z",
      "endsAt": "2025-11-06T16:45:00.0000000Z",
      "category": [
        "Unconference",
        "Beginner"
      ],
      "room": "Room 4",
      "speakers": [
        "Berwout de Vries Robles"
      ],
      "description": "Act as a post‑mortem investigator: examine real IT incidents without metrics or logs and figure out what happened by asking yes/no questions. A fun, interactive session that hones your problem‑solving skills."
    },
    {
      "title": "The Wait is Over: Foreign Function & Memory (FFM) API brings modern Java to the Raspberry Pi",
      "startsAt": "2025-11-06T15:55:00.0000000Z",
      "endsAt": "2025-11-06T16:45:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 3",
      "speakers": [
        "Frank Delporte"
      ],
      "description": "Pi4J has enabled Java to control Raspberry Pi electronics since 2012. With the FFM API finalized in Java 22 and Java 25, integrating native code is easier and faster. Learn how the new FFM‑based implementation simplifies support, reduces overhead, and enables high‑performance demos controlling LEDs, buttons and sensors."
    },
    {
      "title": "Java developer-friendly frontends: Build UIs without the JavaScript hassle",
      "startsAt": "2025-11-06T15:55:00.0000000Z",
      "endsAt": "2025-11-06T16:45:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 2",
      "speakers": [
        "Jago de Vreede"
      ],
      "description": "Backend developers sometimes need to build UIs but don’t want to dive into JavaScript frameworks. This talk compares three tools—HTMX, Vaadin and JavaFX—by building the same UI in each, helping you choose the best option for your next project."
    },
    {
      "title": "YOLO - moving straight to production",
      "startsAt": "2025-11-06T15:55:00.0000000Z",
      "endsAt": "2025-11-06T16:45:00.0000000Z",
      "category": [
        "Technical Session",
        "Beginner"
      ],
      "room": "Room 1",
      "speakers": [
        "Adam Michalik"
      ],
      "description": "Rabobank squads go straight to production multiple times a day using autonomous teams, DevOps and decoupled microservices. Learn how to shorten the testing chain, reduce delivery time, enhance reliability and deliver high‑quality software without multiple test environments."
    },
    {
      "title": "Have you gone MADR?",
      "startsAt": "2025-11-06T16:10:00.0000000Z",
      "endsAt": "2025-11-06T16:25:00.0000000Z",
      "category": [
        "Byte size (16 min)",
        "Beginner"
      ],
      "room": "Room 8",
      "speakers": [
        "Johan Hutting"
      ],
      "description": "Learn about Markdown Any Decision Records (MADR) for documenting decisions. See how to structure and read past decisions, apply MADR to architecture and beyond, and use Markdown in JavaDoc to centralize technical documentation."
    },
    {
      "title": "Green AI with JobRunr: Sustainable training and inference on the JVM",
      "startsAt": "2025-11-06T16:25:00.0000000Z",
      "endsAt": "2025-11-06T16:40:00.0000000Z",
      "category": [
        "Byte size (16 min)",
        "Beginner"
      ],
      "room": "Room 8",
      "speakers": [
        "Ronald Dehuysser"
      ],
      "description": "AI workloads consume a lot of energy. This talk shows how to schedule AI training and inference tasks when energy is greener and cheaper using JobRunr, carbon‑intensity data and dynamic cloud pricing. Integrate local AI workloads with Ollama and measure sustainability impact and cost savings."
    },
    {
      "title": "Drinks",
      "startsAt": "2025-11-06T16:45:00.0000000Z",
      "endsAt": "2025-11-06T18:00:00.0000000Z",
      "category": [],
      "room": "Market floor",
      "speakers": [],
      "description": "End-of‑day drinks and networking."
    }
  ]

}